function slugify(title) {
  return (
    String(title)
      // .normalize("NFKD") // ділить символи з наголосом на базові символи та діакритичні знаки
      //   .replace(/[\u0300-\u036f]/g, "") // видалення всіх наголосів, які є в блоці \u03xx UNICODE.
      //   .trim() // обрізання пробілів на початку або в кінці
      //   .toLowerCase() // конвертувати в нижній регістр
      .replace(/[^a-z0-9 -]/g, "") // видаляємо не буквено-цифрові символи
      .replace(/\s+/g, "-") // замінити пробіли дефісами
      .replace(/-+/g, "-")
  ); // видалити послідовні дефіси
}
